PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1789.inc
;----- PSMC4SYNC Bits -----------------------------------------------------
P4SYNC0          EQU  H'0000'
P4SYNC1          EQU  H'0001'
P4SYNC2          EQU  H'0002'
P4DCPOL          EQU  H'0005'
P4PRPOL          EQU  H'0006'
P4POFST          EQU  H'0007'


;----- PSMC4CLK Bits -----------------------------------------------------
P4CSRC0          EQU  H'0000'
P4CSRC1          EQU  H'0001'
P4CPRE0          EQU  H'0004'
P4CPRE1          EQU  H'0005'



;----- PSMC4OEN Bits -----------------------------------------------------
P4OEA            EQU  H'0000'
P4OEB            EQU  H'0001'


;----- PSMC4POL Bits -----------------------------------------------------
P4POLA           EQU  H'0000'
P4POLB           EQU  H'0001'
P4INPOL          EQU  H'0006'


;----- PSMC4BLNK Bits -----------------------------------------------------
P4REBM0          EQU  H'0000'
P4REBM1          EQU  H'0001'
P4FEBM0          EQU  H'0004'
P4FEBM1          EQU  H'0005'


;----- PSMC4REBS Bits -----------------------------------------------------
P4REBSC1         EQU  H'0001'
P4REBSC2         EQU  H'0002'
P4REBSC3         EQU  H'0003'
P4REBSC4         EQU  H'0004'
P4REBSIN         EQU  H'0007'


;----- PSMC4FEBS Bits -----------------------------------------------------
P4FEBSC1         EQU  H'0001'
P4FEBSC2         EQU  H'0002'
P4FEBSC3         EQU  H'0003'
P4FEBSC4         EQU  H'0004'
P4FEBSIN         EQU  H'0007'


;----- PSMC4PHS Bits -----------------------------------------------------
P4PHST           EQU  H'0000'
P4PHSC1          EQU  H'0001'
P4PHSC2          EQU  H'0002'
P4PHSC3          EQU  H'0003'
P4PHSC4          EQU  H'0004'
P4PHSIN          EQU  H'0007'


;----- PSMC4DCS Bits -----------------------------------------------------
P4DCST           EQU  H'0000'
P4DCSC1          EQU  H'0001'
P4DCSC2          EQU  H'0002'
P4DCSC3          EQU  H'0003'
P4DCSC4          EQU  H'0004'
P4DCSIN          EQU  H'0007'


;----- PSMC4PRS Bits -----------------------------------------------------
P4PRST           EQU  H'0000'
P4PRSC1          EQU  H'0001'
P4PRSC2          EQU  H'0002'
P4PRSC3          EQU  H'0003'
P4PRSC4          EQU  H'0004'
P4PRSIN          EQU  H'0007'


;----- PSMC4ASDC Bits -----------------------------------------------------
P4ASDOV          EQU  H'0000'
P4ARSEN          EQU  H'0005'
P4ASDEN          EQU  H'0006'
P4ASE            EQU  H'0007'


;----- PSMC4ASDL Bits -----------------------------------------------------
P4ASDLA          EQU  H'0000'
P4ASDLB          EQU  H'0001'


;----- PSMC4ASDS Bits -----------------------------------------------------
P4ASDSC1         EQU  H'0001'
P4ASDSC2         EQU  H'0002'
P4ASDSC3         EQU  H'0003'
P4ASDSC4         EQU  H'0004'
P4ASDSIN         EQU  H'0007'


;----- PSMC4INT Bits -----------------------------------------------------
P4TPRIF          EQU  H'0000'
P4TDCIF          EQU  H'0001'
P4TPHIF          EQU  H'0002'
P4TOVIF          EQU  H'0003'
P4TPRIE          EQU  H'0004'
P4TDCIE          EQU  H'0005'
P4TPHIE          EQU  H'0006'
P4TOVIE          EQU  H'0007'


;----- PSMC4PHL Bits -----------------------------------------------------
PSMC4PH0         EQU  H'0000'
PSMC4PH1         EQU  H'0001'
PSMC4PH2         EQU  H'0002'
PSMC4PH3         EQU  H'0003'
PSMC4PH4         EQU  H'0004'
PSMC4PH5         EQU  H'0005'
PSMC4PH6         EQU  H'0006'
PSMC4PH7         EQU  H'0007'


;----- PSMC4PHH Bits -----------------------------------------------------
PSMC4PH8         EQU  H'0000'
PSMC4PH9         EQU  H'0001'
PSMC4PH10        EQU  H'0002'
PSMC4PH11        EQU  H'0003'
PSMC4PH12        EQU  H'0004'
PSMC4PH13        EQU  H'0005'
PSMC4PH14        EQU  H'0006'
PSMC4PH15        EQU  H'0007'


;----- PSMC4DCL Bits -----------------------------------------------------
PSMC4DC0         EQU  H'0000'
PSMC4DC1         EQU  H'0001'
PSMC4DC2         EQU  H'0002'
PSMC4DC3         EQU  H'0003'
PSMC4DC4         EQU  H'0004'
PSMC4DC5         EQU  H'0005'
PSMC4DC6         EQU  H'0006'
PSMC4DC7         EQU  H'0007'


;----- PSMC4DCH Bits -----------------------------------------------------
PSMC4DC8         EQU  H'0000'
PSMC4DC9         EQU  H'0001'
PSMC4DC10        EQU  H'0002'
PSMC4DC11        EQU  H'0003'
PSMC4DC12        EQU  H'0004'
PSMC4DC13        EQU  H'0005'
PSMC4DC14        EQU  H'0006'
PSMC4DC15        EQU  H'0007'


;----- PSMC4PRL Bits -----------------------------------------------------
PSMC4PR0         EQU  H'0000'
PSMC4PR1         EQU  H'0001'
PSMC4PR2         EQU  H'0002'
PSMC4PR3         EQU  H'0003'
PSMC4PR4         EQU  H'0004'
PSMC4PR5         EQU  H'0005'
PSMC4PR6         EQU  H'0006'
PSMC4PR7         EQU  H'0007'


;----- PSMC4PRH Bits -----------------------------------------------------
PSMC4PR8         EQU  H'0000'
PSMC4PR9         EQU  H'0001'
PSMC4PR10        EQU  H'0002'
PSMC4PR11        EQU  H'0003'
PSMC4PR12        EQU  H'0004'
PSMC4PR13        EQU  H'0005'
PSMC4PR14        EQU  H'0006'
PSMC4PR15        EQU  H'0007'


;----- PSMC4TMRL Bits -----------------------------------------------------
PSMC4TMR0        EQU  H'0000'
PSMC4TMR1        EQU  H'0001'
PSMC4TMR2        EQU  H'0002'
PSMC4TMR3        EQU  H'0003'
PSMC4TMR4        EQU  H'0004'
PSMC4TMR5        EQU  H'0005'
PSMC4TMR6        EQU  H'0006'
PSMC4TMR7        EQU  H'0007'


;----- PSMC4TMRH Bits -----------------------------------------------------
PSMC4TMR8        EQU  H'0000'
PSMC4TMR9        EQU  H'0001'
PSMC4TMR10       EQU  H'0002'
PSMC4TMR11       EQU  H'0003'
PSMC4TMR12       EQU  H'0004'
PSMC4TMR13       EQU  H'0005'
PSMC4TMR14       EQU  H'0006'
PSMC4TMR15       EQU  H'0007'


;----- PSMC4DBR Bits -----------------------------------------------------
PSMC4DBR0        EQU  H'0000'
PSMC4DBR1        EQU  H'0001'
PSMC4DBR2        EQU  H'0002'
PSMC4DBR3        EQU  H'0003'
PSMC4DBR4        EQU  H'0004'
PSMC4DBR5        EQU  H'0005'
PSMC4DBR6        EQU  H'0006'
PSMC4DBR7        EQU  H'0007'


;----- PSMC4DBF Bits -----------------------------------------------------
PSMC4DBF0        EQU  H'0000'
PSMC4DBF1        EQU  H'0001'
PSMC4DBF2        EQU  H'0002'
PSMC4DBF3        EQU  H'0003'
PSMC4DBF4        EQU  H'0004'
PSMC4DBF5        EQU  H'0005'
PSMC4DBF6        EQU  H'0006'
PSMC4DBF7        EQU  H'0007'


;----- PSMC4BLKR Bits -----------------------------------------------------
PSMC4BLKR0       EQU  H'0000'
PSMC4BLKR1       EQU  H'0001'
PSMC4BLKR2       EQU  H'0002'
PSMC4BLKR3       EQU  H'0003'
PSMC4BLKR4       EQU  H'0004'
PSMC4BLKR5       EQU  H'0005'
PSMC4BLKR6       EQU  H'0006'
PSMC4BLKR7       EQU  H'0007'


